[{"title":"The Scriptures","icon":"fa-book","Content":"We believe the Holy Scriptures of the Old and New Testaments to be the Bible, \"as it is in truth, the Word of God...\" (I Thessalonians 2:13). We believe in verbal, plenary inspiration in the original writings, and God's preservation of His pure words to every generation (II Timothy 3:16, Psalms 12:6-8).\n\nThe Masoretic Text of the Old Testament and the Received Text of the New Testament (Textus Receptus) are those texts of the original languages we accept and use; the King James Version of the Bible is the only English version we accept and use. The Bible is our sole authority for faith and practice."},{"title":"The Godhead","icon":"fa-users","Content":"We believe in one Triune God, eternally existing in three persons--Father, Son, and Holy Spirit, co-eternal in being, co-identical in nature, co-equal in power and glory, and having the same attributes and perfections (Deuteronomy 6:4; II Corinthians 13:14)."},{"title":"The Person &amp; Work of Christ","icon":"fa-user","Content":"We believe that the Lord Jesus Christ, the eternal Son of God, became man, without ceasing to be God, having been conceived by the Holy Spirit and born of the virgin Mary, in order that He might reveal God and redeem sinful men (John 1:1-2, 14; Luke 1:35; Isaiah 9:6; 7:14; Philippians 2:5-8; Galatians 4:4-5).\n\nWe believe that the Lord Jesus Christ accomplished our redemption through His finished work on the cross as a representative, vicarious, substitutionary sacrifice; and that our justification is made sure by His literal, physical resurrection from the dead (Romans 3:24-25; I Peter 2:24; Ephesians 1:7; I Peter 1:3-5).\n\nWe believe that the Lord Jesus Christ ascended to Heaven, and is now exalted at the right hand of God, where, as our High Priest, He fulfills the ministry of Representative, Intercessor, and Advocate (Acts 1:9-10; Hebrews 9:24, 7:25; Romans 8:34; I John 2:1-2)."},{"title":"The Person &amp; Work of the Holy Spirit","icon":"fa-fire","Content":"We believe that the Holy Spirit is the Person who reproves the world of sin, of righteousness, and of judgment; and that He is the Supernatural Agent in regeneration, indwelling all believers and sealing them unto the day of redemption (John 16:8-11; II Corinthians 3:6; Romans 8:9; Ephesians 1:13-14).\n\nWe believe that the sign gifts of the Holy Spirit, such as speaking in tongues and the gift of healing, were temporary. We believe that speaking in tongues was never the common or necessary sign of the baptism or filling of the Holy Spirit and that ultimate deliverance of the body from sickness or death awaits the consummation of our salvation in the\nresurrection, though God frequently chooses to answer the prayer of believers for physical healing (II Corinthians 12:12; I Corinthians 13:8; Hebrews 2:3-4; Mark 16:17-20; I Corinthians 1:22, 14:21-22)."},{"title":"Man","icon":"fa-male","Content":"We believe that man was created in the image and likeness of God, but that in Adam's sin the race fell, inherited a sinful nature, and became alienated from God; and that man is totally depraved, and, of himself, utterly unable to remedy his lost condition (Genesis 1:26-27; Romans 3:22-23; Ephesians 2:1-3, 12).\n\nThe sacredness of human personality is evident in that God created man in His own image and is mindful of him, and in that Christ died for man; therefore every individual possesses dignity and is worthy of respect and Christian love (Psalm 8:4-9; Colossians 3:9-11)."},{"title":"The Way of Salvation","icon":"fa-medkit","Content":"We believe that the clear message of salvation is \"repentance toward God and faith toward our Lord Jesus Christ\" (Acts 20:21). We believe that salvation is \"by grace\" plus nothing minus nothing. We believe that men are justified by faith alone and are accounted righteous before God only through the merit of our Lord and Saviour Jesus Christ (Ephesians 2:8-10; John 1:12; I Peter 1:18-19).\n\nWe believe that all the redeemed, once saved are kept by God's power and are thus secure in Christ forever. We believe that eternal life is the present possession of every believer (John 6:37-40, 10:27-30; Romans 8:1, 38-39; I Corinthians 1:4-8; I Peter 1:4-5; Jude 1, 2)."},{"title":"The Church","icon":"fa-institution","Content":"We believe that the New Testament church is a local assembly of baptized believers who have voluntarily joined themselves together to carry out the Great Commission. The Lord is doing His work in this world through local churches. The establishment and continuance of local churches is clearly taught and defined in the New Testament Scriptures (Acts 14:27; 20:17, 28-32; I Timothy 3:1-13; Titus 1:5-11).\n\nWe believe in the autonomy of the local church free of any external authority or control. Christ is the only head of the church (Acts 13:1-4, 15:19-31, 20:28; Romans 16:1, 4; I Corinthians 3:9,16; 5:4-7,13; I Peter 5:1-4)."},{"title":"The Ordinances of the Church","icon":"fa-list","Content":"We recognize the ordinances of baptism by immersion in water and the Lord's Supper as a Scriptural means of testimony for local churches in this age (Matthew. 28:19-20; Acts 2:41-42, 18:18; I Corinthians 11:23-26)."},{"title":"Biblical Separation","icon":"fa-warning","Content":"We believe that all the saved should live in such a manner as not to bring reproach upon their Savior and Lord; and, that separation from all religious apostasy, all worldly and sinful pleasures, practices and associations is commanded of God (II Timothy 3:1-5; Romans 12:1, 2, 14:13; I John 2:15-17; II John 9-11; II Corinthians 6:14-7:1)."},{"title":"The Return Of Christ","icon":"fa-long-arrow-down","Content":"We believe the \"Blessed Hope\" of our Lord's return is literal, personal, visible, imminent, premillennial, and pretribulational. Believers will caught up to be with the Lord prior to the, seven years of tribulation, and at the end of the tribulation Christ will return with His saints to establish His thousand-year reign on the earth (I Thessalonians 4:13-18; Titus 2:13; I Thessalonians 1:10; Revelation 3:10; Zechariah 14:4-11; Revelation 19:11-16, 20:1-6; Psalm 89:3-4)."},{"title":"Our Eternal State","icon":"fa-gavel","Content":"We believe in the bodily resurrection of all men, the saved to eternal life, and the unsaved to judgment and everlasting punishment (Matthew 25:46; John 5:28, 29, 11:25-26; Revelation 20:5-6, 12-13).\n\nWe believe that the souls of the redeemed are, at death, absent from the body and present with the Lord, where in conscious bliss they await the first resurrection, when spirit, soul, and body are reunited to be glorified forever with the Lord (Luke 23:43; Revelation 20:4-6; II Corinthians 5:8; Philippians 1:23, 3:21; I Thessalonians 4:16-17).\n\nWe believe that the souls of unbelievers remain, after death, in conscious misery until the second resurrection, when with soul and body reunited they shall appear at the Great White Throne Judgment, and shall be cast into the Lake of Fire, not to be annihilated, but to suffer everlasting, conscious punishment (Luke 16:19-26; Matthew 25:41-46; II Thessalonians 1:7-9; Jude 6-7; Mark 9:43-48; Revelation 20:11-15)."}]
