[{"Instructions":"This is a single line base.  Just use these this row.","Content":"### Realize That God Loves You\n\nGod loves you and has a plan for your life.\n\n>  *“For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.”* John 3:16\n\n### The Bible Says That All Men Are Sinners \n\nOur sins have separated us from God. \n\n> *“For all have sinned, and come short of the glory of God.”* Romans 3:23\n\nGod made man in His own image. He gave man the ability to choose right from wrong. We  choose to sin. Our sins keep us from God.\n\nGod’s Word Also Says That Sin Must Be Paid For\n\n> *“For the wages of sin is death....”* Romans 6:23\n\n\"Wages\" means payment. The payment of our sin is death and hell, separation from God forever. If we continue in our sin, we shall die without Christ and be without God forever.\n\n### The Good News Is That Christ Paid For Our Sins\n\nAll of our sins were laid on Christ on the cross. He paid our sin debt for us. The Lord Jesus Christ died on the cross, and He arose from the dead. He is alive forevermore.\n\n> *“But God commendeth his love toward us, in that, while we were yet sinners, Christ died for us.”* Romans 5:8\n\n### We Must Personally Pray And Receive Christ By Faith\n\nThe Bible says, *“For whosoever shall call upon the name of the Lord shall be saved.”* Romans 10:13\n\n### Pray And Receive Christ As Your Savior\n\nLord, I know that I am a sinner. If I died today, I would not go to heaven. Forgive my sin, come into my life and be my Savior. Help me live for you from this day forward. In Jesus’ Name, Amen.\n\nThe Bible says, *“For whosoever shall call upon the name of the Lord shall be saved.”* Romans 10:13\n\n### New Life\n\nEverlasting life begins when we receive Christ as our Savior.\n","Featured_Image":[{"id":"attDfDloIvnb5Cf9o","url":"https://dl.airtable.com/iTdL8YsT6SW8v1pcNML2_Gospel.png","filename":"Gospel.png","size":1948345,"type":"image/png","thumbnails":{"small":{"url":"https://dl.airtable.com/bbkordVzTV6ZNMaQzrIh_small_Gospel.png","width":64,"height":36},"large":{"url":"https://dl.airtable.com/M8r1qjFjQZ22ZpGhjiCZ_large_Gospel.png","width":512,"height":512}}}],"Heading":"Are You Sure?"}]
